/*
  학생 성적 관리 프로그램
  - 키보드를 통해 성적을 입력받아 처리한다.
  - 학생등록, 학생삭제, 학생검색, 학생출력, 파일로드, 파일저장, 작업종료

  <입력 및 출력형식>
  성적 관리 프로그램
  ****************************************************************************
   [1] 입력   [2] 삭제   [3] 검색   [4] 출력   [5] 로드   [6] 저장   [7] 종료
  ****************************************************************************
  메뉴 =  
  
  == 학생 등록 ==
  학번 =
  이름 = 
  국어 = 
  영어 = 
  수학 =
 
  == 전체 학생 정보 출력 ==
  학번    이름     국어     영어     수학     총점    평균    학점    등수
  -------------------------------------------------------------------------

  == 학생 검색 ==
  학번 = 

  [검색대상]
  학번    이름     국어     영어     수학     총점    평균    학점    등수
  -------------------------------------------------------------------------

  == 학생 삭제 ==
  학번 = 

  [삭제대상]
  학번    이름     국어     영어     수학     총점    평균    학점    등수
  -------------------------------------------------------------------------

  == 전체 학생 정보 출력 ==


*/